temp_status_change_03.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <s:Header>
        <o:Security s:mustUnderstand="1" xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <o:UsernameToken u:Id="uuid-912d25f7-0622-4467-b4ef-39c078b165e4-68">
                <o:Username>CNG</o:Username>
                <o:Password o:Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Password1</o:Password>
            </o:UsernameToken>
        </o:Security>
    </s:Header>
    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <PutStatus xmlns="http://services.mycccportal.com/SOA/StatusChangeService">
            <NormalizedMessageList xmlns="http://services.mycccportal.com/SOA/normalizedmessage/v1">
                <NormalizedMessage>
                    <BaseDescriptor>
                        <MsgID>5ec2fb33-de09-4eaf-9fb6-11b25baa03ab</MsgID>
                        <MsgType>StatusChange</MsgType>
                        <MsgMode>Request</MsgMode>
                        <SourceTimeStamp>2017-04-17T05:49:28.6037479-05:00</SourceTimeStamp>
                        <SourceApplicationID>PTHWY</SourceApplicationID>
                        <SourceUserID>NA</SourceUserID>
                    </BaseDescriptor>
                    <RoutingDescriptor>
                        <RoutingInfo xmlns="http://services.mycccportal.com/SOA/commontypes">
                            <ApplicationName>PTHWY</ApplicationName>
                            <ApplicationVersion>4.50</ApplicationVersion>
                            <PublishTimeStamp>2017-04-17T05:43:20.7494776-05:00</PublishTimeStamp>
                        </RoutingInfo>
                        <RoutingInfo xmlns="http://services.mycccportal.com/SOA/commontypes">
                            <ApplicationName>PTHWY</ApplicationName>
                            <ApplicationVersion>4.50</ApplicationVersion>
                            <PublishTimeStamp>2017-04-17T05:49:28.6037479-05:00</PublishTimeStamp>
                        </RoutingInfo>
                    </RoutingDescriptor>
                    <ClaimDescriptor>
                        <ClaimReferenceID>TESTRFS02APR17</ClaimReferenceID>
                        <ClaimTypeCode>VE</ClaimTypeCode>
                        <InsuranceCompany>
                            <VantiveCode>APM1</VantiveCode>
                        </InsuranceCompany>
                        <ClaimOffice>
                            <Code>APMC</Code>
                        </ClaimOffice>
                        <AssigneeDescriptor>
                            <Appraiser>
                                <AppraiserType>DRP</AppraiserType>
                                <AppraiserSSN>302800</AppraiserSSN>
                                <AppraiserMailboxID/>
                            </Appraiser>
                        </AssigneeDescriptor>
                    </ClaimDescriptor>
                    <Payload>
                        <Data>PD94bWwgdmVyc2lvbj0iMS4wIj8+DQo8U3RhdHVzQ2hhbmdlIHhtbG5zOnhzaT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEtaW5zdGFuY2UiIHhtbG5zOnhzZD0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEiIHhtbG5zPSJodHRwOi8vc2VydmljZXMubXljY2Nwb3J0YWwuY29tL1NPQS9TdGF0dXNDaGFuZ2VTZXJ2aWNlL1BheWxvYWQiPg0KICA8UmVmZXJlbmNlPmh0dHA6Ly9zZXJ2aWNlcy5teWNjY3BvcnRhbC5jb20vRXZlbnRzL2Q5NmI0YzBmLWE0OTgtNGQ0Zi05ZTdiLTg4YTIyZmJlMDFlNS8xZjdmMDNlNS02OWEwLTQ0NWEtYjAxMC1iYTk3Y2YyZWE1ZDg8L1JlZmVyZW5jZT4NCiAgPFN0YXR1c1R5cGU+UHVibGlzaGluZzwvU3RhdHVzVHlwZT4NCiAgPFN0YXR1c1N0YXRlPlB1Ymxpc2hlZDwvU3RhdHVzU3RhdGU+DQo8L1N0YXR1c0NoYW5nZT4=</Data>
                        <Reference>http://services.mycccportal.com/Events/d96b4c0f-a498-4d4f-9e7b-88a22fbe01e5/1f7f03e5-69a0-445a-b010-ba97cf2ea5d8</Reference>
                    </Payload>
                </NormalizedMessage>
            </NormalizedMessageList>
        </PutStatus>
    </s:Body>
</s:Envelope>
